


//лабораторна робота номер 6
//Дано масив цілих чисел. Вивести всі елементи, які йдуть за останнім 
//елементом, що закінчується цифрою 7. Якщо елементів, що закінчуються 
//цифрою 7, в масиві немає, то ні один елемент не повинен бути виведений. 
//Написати метод, який розмістить всі елементи з нульовими значеннями в лівій 
//частині масиву, елементи з негативними значеннями - за ними, а за ними - елементи 
//з позитивними значеннями.

using System;

class Program
{
    static void Main()
    {
        int[] numbers = new int[199];

        // Заповнюємо масив числами від -99 до 99
        for (int i = 0; i < numbers.Length; i++)
        {
            numbers[i] = i - 99;
        }

        // Виводимо масив
        Console.WriteLine("Масив чисел від -99 до 99:");
        PrintArray(numbers);
    }

    // Метод для виведення масиву
    static void PrintArray(int[] array)
    {
        foreach (int number in array)
        {
            Console.Write(number + " ");
        }
        Console.WriteLine();
    }
}



